node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 250
          }
          dim {
            size: 4
          }
        }
        tensor_content: "\314\345?\244\337\276\316?\315\314\314\314\314\314\354\277\232\231\231\231\231\231\001@\000\000\000\000\000\000I@\346\202\034\266O\351\302?\353Q\270\036\205\353\361\277\000\000\000\000\000\000\360?\000\000\000\000\000\200Y@@\023a\303\323+\325?\232\231\231\231\231\231\351\277333333\373?\000\000\000\000\000\000I@!\375[+\324\230\307?\232\231\231\231\231\231\371\277\232\231\231\231\231\231\001@\000\000\000\000\000\340}@\364(\\\217\302\365\320?\315\314\314\314\314\314\354\277\270\036\205\353Q\270\376?\000\000\000\000\000@c@\234\224\376e:\300\310?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\370?\000\000\000\000\000@Y@\263\352s\265\025\373\313?\315\314\314\314\314\314\354\277333333\373?\000\000\000\000\000\000I@m\240\323\006:m\320?\315\314\314\314\314\314\354\277333333\373?\000\000\000\000\000\340c@\334h\000o\201\004\305?\244p=\n\327\243\360\277\232\231\231\231\231\231\351?\000\000\000\000\000\000I@\272\352-@\210{\322?\232\231\231\231\231\231\351\277\000\000\000\000\000\000\000@\000\000\000\000\000\240c@\225f\210\034\017\030\322?\353Q\270\036\205\353\341\277\232\231\231\231\231\231\001@\000\000\000\000\000\300Y@\307^\007S\353H\312?\232\231\231\231\231\231\351\277\244p=\n\327\243\000@\000\000\000\000\000\240c@\345\024d\"F\t\324?\000\000\000\000\000\000\360\277333333\007@\000\000\000\000\000\200j@\343\024\035\311\345?\324?ffffff\366\277\315\314\314\314\314\314\374?\000\000\000\000\000\000Y@\306\243_\3425\376\325?\315\314\314\314\314\314\354\277433333\003@\000\000\000\000\000\300i@\221\266Q\276p:\321?\232\231\231\231\231\231\351\277H\341z\024\256G\001@\000\000\000\000\000\300X@\275/\275.O\017\315?\315\314\314\314\314\314\354\277333333\363?\000\000\000\000\000@Y@\3552\304[\213D\317?\257G\341z\024\256\367\277\232\231\231\231\231\231\t@\000\000\000\000\000d\230@\227\263l\376\031\323\324?\353Q\270\036\205\353\341\277\000\000\000\000\000\000\370?\000\000\000\000\000\000J@\337\234\244\334\362\323\303?\232\231\231\231\231\231\351\277333333\373?\000\000\000\000\000\200Z@)7\333ma\024\315?333333\343\277333333\373?\000\000\000\000\000\300Y@O\031\276\021\005&\315?\232\231\231\231\231\231\351\277\000\000\000\000\000\000\370?\000\000\000\000\000@Y@\255F?\255\303&\320?\232\231\231\231\231\231\361\277ffffff\002@\000\000\000\000\000\350\200@u\033%\272\344\360\310?\013\327\243p=\n\347\277333333\363?\000\000\000\000\000@Y@\244p=\n\327\243\320?ffffff\346\277\315\314\314\314\314\314\374?\000\000\000\000\000\000J@\'\016\221\233v\225\314?\315\314\314\314\314\314\374\277ffffff\002@\000\000\000\000\000\340b@2\017\325\206\320U\324?\000\000\000\000\000\000\360\277ffffff\002@\000\000\000\000\000\020s@\314\025\213\333\342W\320?\315\314\314\314\314\314\374\277\232\231\231\231\231\231\005@\000\000\000\000\000P\226@\251\nF%u\002\272?\013\327\243p=\n\347\277p=\n\327\243p\355?\000\000\000\000\000\000I@\231\231\231\231\231\231\311?\232\231\231\231\231\231\351\277\232\231\231\231\231\231\361?\000\000\000\000\000\200H@a\217\302\365(\\\327?\232\231\231\231\231\231\351\277\000\000\000\000\000\000\000@\000\000\000\000\000\300c@\372w\0311\253L\320?ffffff\366\277\232\231\231\231\231\231\371?\000\000\000\000\000\200c@\205s\200\356\025\345\325?\315\314\314\314\314\314\354\277333333\373?\000\000\000\000\000Pp@\320\"\333\371~j\314?\232\231\231\231\231\231\351\277333333\003@\000\000\000\000\000\000N@\311\257^\330\241\363\320?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\370?\000\000\000\000\000@c@(l\033\366R6\315?\000\000\000\000\000\000\360\277\315\314\314\314\314\314\000@\000\000\000\000\000\200m@\217]*\367\303\220\325?\353Q\270\036\205\353\341\277\000\000\000\000\000\000\004@\000\000\000\000\000\200Y@H\242%\303\020\003\315?ffffff\376\277333333\373?\000\000\000\000\000\240s@\320\234\272\021$\274\323?\232\231\231\231\231\231\351\277\000\000\000\000\000\000\000@\000\000\000\000\000 i@t\032\263\205\374\231\317?\353Q\270\036\205\353\341\277\000\000\000\000\000\000\004@\000\000\000\000\000\200Z@:\t\0044%\217\324?\315\314\314\314\314\314\364\277333333\007@\000\000\000\000\000\320}@M\253Y\3542\350\321?\000\000\000\000\000\000\360\277\000\000\000\000\000\000\004@\000\000\000\000\000\200b@\263\335\304p\345$\320?{\024\256G\341z\370\277\315\314\314\314\314\314\000@\000\000\000\000\000\330\203@\260\021\305\332\032\214\322?\232\231\231\231\231\231\351\277ffffff\002@\000\000\000\000\000\340b@?N\321\221\\\376\303?\000\000\000\000\000\000\360\277\232\231\231\231\231\231\361?\000\000\000\000\000\000I@#X\213\276\361$\320?\315\314\314\314\314\314\354\277\232\231\231\231\231\231\371?\000\000\000\000\000\200Y@C:\230\316s\257\302?\232\231\231\231\231\231\361\277\232\231\231\231\231\231\371?\000\000\000\000\000@X@\001[\260\005[\260\321?\232\231\231\231\231\231\351\277\232\231\231\231\231\231\371?\000\000\000\000\000\000[@\272\231\237\2552\033\323?ffffff\346\277\000\000\000\000\000\000\000@\000\000\000\000\000\240c@\213)\303\\\366\217\321?333333\343\277ffffff\376?\000\000\000\000\000\200Y@\312wd\330 n\316?\000\000\000\000\000\000\360\277\232\231\231\231\231\231\001@\000\000\000\000\000\200Z@\355\271\352\353\004\022\321?333333\373\277\232\231\231\231\231\231\001@\000\000\000\000\000 \200@\017\000\000\000\000\020\320?*\\\217\302\365(\374\277ffffff\376?\000\000\000\000\000\000p@\002\037\270\374\316B\320?\315\314\314\314\314\314\354\277333333\003@\000\000\000\000\000\300Y@\336`AI\307\247\323?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\374?\000\000\000\000\000\200c@\006\n\265\355\307\213\316?ffffff\366\277ffffff\376?\000\000\000\000\000\300Y@\267h\277)\317%\314?\315\314\314\314\314\314\354\277ffffff\366?\000\000\000\000\000\000Z@\342p\016\347p\016\323?\315\314\314\314\314\314\354\277333333\003@\000\000\000\000\000\200c@>\330\360\364JY\322?\232\231\231\231\231\231\351\277\315\314\314\314\314\314\374?\000\000\000\000\000\000Y@\221D;I\264\223\324?\000\000\000\000\000\000\360\277\315\314\314\314\314\314\374?\000\000\000\000\000\300X@\037\304\333U\367\016\323?\232\231\231\231\231\231\351\277ffffff\366?\000\000\000\000\000\000Z@\003G\227\337\n!\317?\315\314\314\314\314\314\354\277333333\373?\000\000\000\000\000@X@a\365r\201*4\312?ffffff\376\277ffffff\376?\000\000\000\000\000\200Z@\020y]\244\022\367\315?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\370?\000\000\000\000\000\200c@\032s?\263\325\335\326?333333\363\277\232\231\231\231\231\231\005@\000\000\000\000\000\300Z@W\026\322\215I\005\321?\232\231\231\231\231\231\351\277\315\314\314\314\314\314\000@\000\000\000\000\000 c@\265t\276t\276t\316?\232\231\231\231\231\231\365\277ffffff\002@\000\000\000\000\000\020\200@\321\337\311jyc\322?ffffff\346\277333333\363?\000\000\000\000\000\000L@c\031\342X\027\267\331?\036\205\353Q\270\036\355\277\232\231\231\231\231\231\371?\000\000\000\000\000\000I@\221\262\014q\254\213\313?\315\314\314\314\314\314\354\277\232\231\231\231\231\231\371?\000\000\000\000\000\000Y@6<\275R\226!\326?ffffff\346\277ffffff\366?\000\000\000\000\000\000I@O\035\352\266\203P\315?\232\231\231\231\231\231\351\277333333\373?\000\000\000\000\000\200I@/\304\261.n\243\321?\232\231\231\231\231\231\361\277\315\314\314\314\314\314\000@\000\000\000\000\000\000Y@\324\203W\033\245\004\324?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\010@\000\000\000\000\000@X@R\257\224e\210c\275?\303\365(\\\217\302\365\277333333\363?\000\000\000\000\000\000I@;H\216h\032\035\306?\315\314\314\314\314\314\354\277333333\373?\000\000\000\000\000\000c@4Z\001}\375`\312?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\000@\000\000\000\000\000\200j@\334\223\207\205Z\323\314?\303\365(\\\217\302\365\277\315\314\314\314\314\314\000@\000\000\000\000\000\300b@\3152\231\377e\314\322?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\364?\000\000\000\000\000\200I@\266\2267F0\321\316?\232\231\231\231\231\231\361\277\000\000\000\000\000\000\370?\000\000\000\000\000\000l@I\255\324J\255\324\316?\232\231\231\231\231\231\351\277ffffff\376?\000\000\000\000\000\000Z@\306\370\320S\201Y\330?\341z\024\256G\341\352\277333333\003@\000\000\000\000\000\000[@#\366T\002}{\306?\315\314\314\314\314\314\354\277ffffff\366?\000\000\000\000\000@Y@~\024\256G\341\n\321?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\010@\000\000\000\000\000\000p@\351\265\252\370D$\331?433333\363\277\315\314\314\314\314\314\000@\000\000\000\000\000`c@\317\210\322\336\340\013\323?ffffff\376\277ffffff\366?\000\000\000\000\000\000I@\010`1m\307\005\323?\232\231\231\231\231\231\351\277333333\003@\000\000\000\000\000@Y@\334\371~j\274t\303?ffffff\346\277\232\231\231\231\231\231\371?\000\000\000\000\000\000I@l\t\371\240g\263\312?\000\000\000\000\000\000\360\277ffffff\376?\000\000\000\000\000\000I@\234\345\250\210/H\275?\232\231\231\231\231\231\371\277\303\365(\\\217\302\365?\000\000\000\000\000@d@\362_\324V\365\313\322?\232\231\231\231\231\231\351\277\315\314\314\314\314\314\374?\000\000\000\000\000`k@\363\345J\000\275\356\320?*\\\217\302\365(\354\277333333\003@\000\000\000\000\000@Z@\273[\365\216(\302\313?*\\\217\302\365(\354\277\232\231\231\231\231\231\371?\000\000\000\000\000\200Y@\333^jk\016c\306?\315\314\314\314\314\314\364\277\232\231\231\231\231\231\371?\000\000\000\000\000\200X@\214\370<\\\254\311\324?)\\\217\302\365(\344\277ffffff\376?\000\000\000\000\000``@!\326-\252o\307\313?333333\363\277333333\003@\000\000\000\000\000@z@\302\365(\\\217\302\312?ffffff\346\277ffffff\376?\000\000\000\000\000\000d@)\\\217\302\365(\314?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\010@\000\000\000\000\000@k@k\376,\347\317r\316?\232\231\231\231\231\231\371\277\000\000\000\000\000\000\000@\000\000\000\000\000\300X@\216\305\2076\257\303\322?\000\000\000\000\000\000\370\277ffffff\002@\000\000\000\000\000\244\222@&\317\344\224!\210\321?\000\000\000\000\000\000\370\277\232\231\231\231\231\231\005@\000\000\000\000\000\014\220@\316\035\277kCX\322?333333\363\277\000\000\000\000\000\000\000@\000\000\000\000\000@\\@\030\037;\306\266F\312?\232\231\231\231\231\231\361\277\315\314\314\314\314\314\374?\000\000\000\000\000\200Z@\251\225Z\251\225Z\325?\232\231\231\231\231\231\361\277333333\017@\000\000\000\000\000\000Z@\276\237\032/\335$\322?\232\231\231\231\231\231\351\277ffffff\376?\000\000\000\000\000\000Y@\214#_\237X\\\320?\232\231\231\231\231\231\351\277ffffff\002@\000\000\000\000\000\200[@0\210\3352\210\335\322?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\364?\000\000\000\000\000 c@\007\'\316I\312-\317?\354Q\270\036\205\353\351\277433333\363?\000\000\000\000\000\200J@\346\350\350\350\350\350\320?)\\\217\302\365(\344\277\000\000\000\000\000\000\010@\000\000\000\000\000\200Y@\\E%f\212\200\323?\315\314\314\314\314\314\374\277\232\231\231\231\231\231\005@\000\000\000\000\000 d@\237\352.s\267\373\317?)\\\217\302\365(\364\277\232\231\231\231\231\231\001@\000\000\000\000\000 c@\217\212\222\342W\264\306?\232\231\231\231\231\231\371\277\000\000\000\000\000\000\000@\000\000\000\000\000\300Y@\277\302\013\374\322\353\322?\232\231\231\231\231\231\351\277\000\000\000\000\000\000\000@\000\000\000\000\000@Y@s\276\237\032/\335\322?333333\373\277333333\373?\000\000\000\000\000\000d@(F\r\177\233b\324?\000\000\000\000\000\000\360\277ffffff\376?\000\000\000\000\000\000[@F\227\314E\"|\316?\232\231\231\231\231\231\361\277\315\314\314\314\314\314\004@\000\000\000\000\000`b@\207\007v\377R\022\320?\013\327\243p=\n\347\277\000\000\000\000\000\000\000@\000\000\000\000\000\000c@\260\315N\361\236\245\324?\013\327\243p=\n\347\277\232\231\231\231\231\231\005@\000\000\000\000\000 d@O\326Hm\247\"\321?\232\231\231\231\231\231\005\300\232\231\231\231\231\231\t@\000\000\000\000\000 f@\306\274\002\251!D\320?\000\000\000\000\000\000\360\277\232\231\231\231\231\231\361?\000\000\000\000\000@Y@\202\254a\264\337\224\323?\232\231\231\231\231\231\351\277ffffff\366?\000\000\000\000\000\000Z@\226\234\344\326.\244\321?333333\363\277\302\365(\\\217\302\007@\000\000\000\000\000 j@Z^\030\334\222\005\323?ffffff\346\277ffffff\002@\000\000\000\000\000\300c@#\253\210\354\277\327\320?\232\231\231\231\231\231\351\277\232\231\231\231\231\231\005@\000\000\000\000\000@Y@\345\340\205\325\317t\324?\232\231\231\231\231\231\351\277\315\314\314\314\314\314\374?\000\000\000\000\000\000K@!\234\240\033\246\213\320?\257G\341z\024\256\357\277\000\000\000\000\000\000\010@\000\000\000\000\000\240b@\267\231\222\023\337\361\322?\244p=\n\327\243\360\277\315\314\314\314\314\314\374?\000\000\000\000\000\300c@\224\332e\322\271\265\317?\303\365(\\\217\302\365\277333333\373?\000\000\000\000\000\300b@:p\374\367m\267\314?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\000@\000\000\000\000\000\340i@\034vb\'vb\307?\315\314\314\314\314\314\354\277\270\036\205\353Q\270\376?\000\000\000\000\000\000Z@\306):\222\313\177\310?\000\000\000\000\000\000\370\277\315\314\314\314\314\314\004@\000\000\000\000\000\000I@\320o\312s\td\315?\000\000\000\000\000\000\360\277333333\373?\000\000\000\000\000\000Z@\212\260\341\351\225\262\314?\353Q\270\036\205\353\341\277\000\000\000\000\000\000\370?\000\000\000\000\000\000I@\214\007\271\360U^\323?333333\373\277ffffff\006@\000\000\000\000\000\020{@\253\t_\264\t_\324?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\000@\000\000\000\000\000 c@\315\017\336[\322\323\324?\232\231\231\231\231\231\351\277333333\373?\000\000\000\000\000@Z@\367\035\022U\204x\313?\315\314\314\314\314\314\364\277\000\000\000\000\000\000\000@\000\000\000\000\000@p@\276J\334\032\326\361\324?\232\231\231\231\231\231\371\277\000\000\000\000\000\000\010@\000\000\000\000\000t\221@*\207\026\331\316\367\323?\232\231\231\231\231\231\331\277\232\231\231\231\231\231\371?\000\000\000\000\000\000I@\333\241\272\035\252\333\321?ffffff\376\277333333\003@\000\000\000\000\000`c@a\007\202;|\221\313?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\374?\000\000\000\000\000\340s@\226\340\227\277\232\325\310?333333\373\277333333\373?\000\000\000\000\000\300Z@\300\273\273\273\273\273\313?\232\231\231\231\231\231\351\277\315\314\314\314\314\314\374?\000\000\000\000\000\200I@\220\030\004V\016\255\325?\232\231\231\231\231\231\361\277\000\000\000\000\000\000\010@\000\000\000\000\000\000d@\3734h\233\316\001\305?\000\000\000\000\000\000\370\277\315\314\314\314\314\314\374?\000\000\000\000\000\200Y@\313~B\371k9\303?\315\314\314\314\314\314\354\277ffffff\376?\000\000\000\000\000\300c@\270JF9\022\235\311?433333\363\277ffffff\376?\000\000\000\000\000\200}@f8b\332\023\031\310?ffffff\376\277\315\314\314\314\314\314\364?\000\000\000\000\000\200X@-\024eBQ&\304?\000\000\000\000\000\000\360\277\315\314\314\314\314\314\000@\000\000\000\000\000`c@\244<\326o\t\243\314?*\\\217\302\365(\354\277\315\314\314\314\314\314\364?\000\000\000\000\000\200I@\326M\377\210\2021\322?\232\231\231\231\231\231\351\277ffffff\006@\000\000\000\000\000\300Y@x\331\307\303\207R\321?\315\314\314\314\314\314\354\277\232\231\231\231\231\231\005@\000\000\000\000\000\340b@\024S\332\256\263\226\324?\000\000\000\000\000\000\360\277\232\231\231\231\231\231\005@\000\000\000\000\000\340c@\r\360\026HP\374\310?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\010@\000\000\000\000\000\000Y@;\303\177\\T\334\321?\232\231\231\231\231\231\361\277\315\314\314\314\314\314\000@\000\000\000\000\000\340b@\236\r!\007\1774\325?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\004@\000\000\000\000\000\300c@\224\000z\335\341\364\321?\000\000\000\000\000\000\000\300ffffff\002@\000\000\000\000\000@Z@\244\214\232\'H(\322?\232\231\231\231\231\231\361\277\000\000\000\000\000\000\000@\000\000\000\000\000\340b@\370\206\230\344\330P\323?\013\327\243p=\n\347\277ffffff\376?\000\000\000\000\000@Z@\314\374l\225\331\030\307?\232\231\231\231\231\231\361\277\315\314\314\314\314\314\004@\000\000\000\000\000\240c@H\341z\024\256G\321?\353Q\270\036\205\353\361\277333333\373?\000\000\000\000\000`a@\216\035c[#\r\324?ffffff\376\277ffffff\376?\000\000\000\000\000\200Z@\217St$\227\377\320?\244p=\n\327\243\360\277\232\231\231\231\231\231\371?\000\000\000\000\000\000I@\230w\234\242#\271\320?ffffff\346\277\315\314\314\314\314\314\374?\000\000\000\000\000\000Y@T\003^<U\026\323?\354Q\270\036\205\353\351\277\232\231\231\231\231\231\371?\000\000\000\000\000@j@\347:w\210\326\354\320?\315\314\314\314\314\314\354\277ffffff\006@\000\000\000\000\000@Y@,\223\316\255\375\212\322?\232\231\231\231\231\231\351\277333333\013@\000\000\000\000\000\300b@\313\210\322\336\340\013\323?\270\036\205\353Q\270\336\277\000\000\000\000\000\000\000@\000\000\000\000\000\000I@\337 z|\027\016\322?\000\000\000\000\000\000\360\277\315\314\314\314\314\314\364?\000\000\000\000\000@[@\365m\3220V0\304?\342z\024\256G\341\372\277333333\373?\000\000\000\000\000`j@\210w\244\005=\374\321?ffffff\346\277\315\314\314\314\314\314\374?\000\000\000\000\000\200H@\303_\026:&\327\320?\000\000\000\000\000\000\370\277333333\007@\000\000\000\000\000\364\225@Re\014\213Z\210\331?ffffff\346\277333333\373?\000\000\000\000\000\200L@1\226\374b\311\257\323?ffffff\376\277\315\314\314\314\314\314\004@\000\000\000\000\000\000h@94\202\200\247&\312?\315\314\314\314\314\314\354\277ffffff\376?\000\000\000\000\000\340b@\240!\347>\273\200\314?\315\314\314\314\314\314\354\277333333\373?\000\000\000\000\000\000\\@\300?\375ut\322\325?\232\231\231\231\231\231\351\277\315\314\314\314\314\314\014@\000\000\000\000\000\300p@\363\336\177\216x\031\320?\303\365(\\\217\302\365\277\000\000\000\000\000\000\014@\000\000\000\000\000\300}@\005\271\337k\262+\322?\341z\024\256G\341\352\277333333\003@\000\000\000\000\000 k@\352\307\213^\'L\316?\232\231\231\231\231\231\351\277ffffff\376?\000\000\000\000\000\300Y@\303\365(\\\217\302\325?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\000@\000\000\000\000\000@j@K7\211A`\345\320?\000\000\000\000\000\000\360\277\232\231\231\231\231\231\371?\000\000\000\000\000\000I@S\341\263P\357\036\320?433333\363\277333333\373?\000\000\000\000\000\340a@A\003\253X\371\034\312?333333\373\277\000\000\000\000\000\000\000@\000\000\000\000\000 k@/*\251\023\320D\320?H\341z\024\256G\341\277\000\000\000\000\000\000\010@\000\000\000\000\000\000I@C\031\332\270\352\037\320?p=\n\327\243p\355\277ffffff\002@\000\000\000\000\000@c@[[\034,(\351\330?333333\343\277\000\000\000\000\000\000\000@\000\000\000\000\000\000J@\254q!S0v\323?\303\365(\\\217\302\365\277\000\000\000\000\000\000\000@\000\000\000\000\000`i@4\010\254\034Zd\313?\232\231\231\231\231\231\361\277\257G\341z\024\256\357?\000\000\000\000\000\000I@_\264\334\255n\234\326?\232\231\231\231\231\231\361\277333333\373?\000\000\000\000\000\200W@\350\270\205R\037\354\320?ffffff\346\277\000\000\000\000\000\000\000@\000\000\000\000\000\200Y@tL_\311\276O\321?\000\000\000\000\000\000\370\277\315\314\314\314\314\314\004@\000\000\000\000\0008\226@\030\267\321\000\336\002\321?\000\000\000\000\000\000\360\277\315\314\314\314\314\314\000@\000\000\000\000\000\000I@\350\027K~\261\344\267?ffffff\376\277\000\000\000\000\000\000\370?\000\000\000\000\000\000K@\342O\266\034\203\351\317?333333\373\277333333\373?\000\000\000\000\000\200Y@\320q\034\307q\034\327?\315\314\314\314\314\314\364\277\232\231\231\231\231\231\005@\000\000\000\000\000\340i@z\362\367\236/\317\324?\315\314\314\314\314\314\354\277\232\231\231\231\231\231\005@\000\000\000\000\000\300Y@\211v\255\246\273\035\315?333333\343\277333333\373?\000\000\000\000\000\300T@\'\316>|\206]\321?\232\231\231\231\231\231\361\277\000\000\000\000\000\000\000@\000\000\000\000\000`h@\330\2273\331\2649\321?\232\231\231\231\231\231\361\277333333\373?\000\000\000\000\000P}@/~\204VR\306\313?\000\000\000\000\000\000\010\300\315\314\314\314\314\314\000@\000\000\000\000\000\200h@-!\037\364lV\315?ffffff\366\277\315\314\314\314\314\314\374?\000\000\000\000\000\000Y@CGr\371\017\351\317?\013\327\243p=\n\347\277\000\000\000\000\000\000\004@\000\000\000\000\000\000Y@\3311\017\036\363\340\321?\353Q\270\036\205\353\341\277333333\373?\000\000\000\000\000`c@\225zsq\225V\322?\315\314\314\314\314\314\364\277\000\000\000\000\000\000\000@\000\000\000\000\000@Y@a]\220h./\313?\315\314\314\314\314\314\354\277ffffff\376?\000\000\000\000\000\220p@D\200\010\244\313\252\314?\244p=\n\327\243\360\277R\270\036\205\353Q\370?\000\000\000\000\000\200Z@\375\207\364\333\327\201\303?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\360?\000\000\000\000\000\000I@\001s\210u\302\253\321?ffffff\376\277333333\017@\000\000\000\000\000`i@\375;\222\262>\363\306?ffffff\346\277\232\231\231\231\231\231\371?\000\000\000\000\000\200\\@\313\207\266\354\035\375\322?)\\\217\302\365(\344\277333333\373?\000\000\000\000\000\300Y@\004<o\242\325\010\324?\013\327\243p=\n\347\277333333\373?\000\000\000\000\000\200Y@\215\227n\022\203\300\316?\232\231\231\231\231\231\351\277ffffff\002@\000\000\000\000\000\000d@\253\020w\335C\252\320?\232\231\231\231\231\231\351\277\315\314\314\314\314\314\374?\000\000\000\000\000\200I@j\241\324\007;n\321?ffffff\346\277\000\000\000\000\000\000\370?\000\000\000\000\000\200Y@Uv\230\272\334\376\320?\315\314\314\314\314\314\354\277333333\373?\000\000\000\000\000 c@|\351Y\230\236\205\321?\232\231\231\231\231\231\361\277\232\231\231\231\231\231\005@\000\000\000\000\000\200d@\311/\226\374b\311\317?\n\327\243p=\n\347\277\000\000\000\000\000\000\370?\000\000\000\000\000\000K@\036\\\217\302\365(\314?\232\231\231\231\231\231\361\277333333\373?\000\000\000\000\000@Z@#\230\350\357d\265\314?\232\231\231\231\231\231\361\277333333\373?\000\000\000\000\000@c@!\275V\360\211#\315?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\370?\000\000\000\000\000\200I@H\261\027~\344J\321?\315\314\314\314\314\314\354\277\000\000\000\000\000\000\370?\000\000\000\000\000\200Y@\240F\320K%7\321?\232\231\231\231\231\231\351\277\232\231\231\231\231\231\371?\000\000\000\000\000@[@\232\231\231\231\231\231\311?333333\343\277\315\314\314\314\314\314\354?\000\000\000\000\000\000$@\365\307\351\036\340X\324?\232\231\231\231\231\231\351\277\232\231\231\231\231\231\005@\000\000\000\000\000\200Z@d\323\027\231\342\211\320?\232\231\231\231\231\231\361\277\232\231\231\231\231\231\001@\000\000\000\000\000@Y@\2205\214\366\233\362\314?ffffff\346\277\315\314\314\314\314\314\364?\000\000\000\000\000\000J@\263\246\364\3651\372\324?ffffff\346\277ffffff\376?\000\000\000\000\000\240c@-22222\322?\232\231\231\231\231\231\361\277\315\314\314\314\314\314\000@\000\000\000\000\000 c@\266\332\212\375e\367\320?H\341z\024\256G\341\277\232\231\231\231\231\231\005@\000\000\000\000\000\000Y@\363ZU|\"\222\324?\342z\024\256G\341\372\277\232\231\231\231\231\231\005@\000\000\000\000\000`c@\224\347\2012\225\210\321?\315\314\314\314\314\314\354\277\232\231\231\231\231\231\001@\000\000\000\000\000\340i@R\237\364I\237\364\321?\232\231\231\231\231\231\371\277ffffff\376?\000\000\000\000\000 s@\024\320D\330\360\364\322?\315\314\314\314\314\314\344\277ffffff\002@\000\000\000\000\000\000I@_\352mVH\246\316?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\374?\000\000\000\000\000@[@7\313d\376\2271\313?\315\314\314\314\314\314\364\277\000\000\000\000\000\000\000@\000\000\000\000\000\200Y@l\232w\234\242#\321?\315\314\314\314\314\314\364\277\303\365(\\\217\302\365?\000\000\000\000\000\000I@1\265*\234\267\304\324?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\374?\000\000\000\000\000pw@7\204R\036A\177\320?\232\231\231\231\231\231\351\277\315\314\314\314\314\314\000@\000\000\000\000\000\300i@Z\265\032[ij\320?333333\343\277\000\000\000\000\000\000\000@\000\000\000\000\000@X@D\021\336\252wD\301?ffffff\376\277ffffff\376?\000\000\000\000\000\200I@\215\3438\216\3438\316?\315\314\314\314\314\314\354\277333333\363?\000\000\000\000\000\000K@\235\353b\023\363]\321?|\024\256G\341z\344\277\232\231\231\231\231\231\001@\000\000\000\000\000\300Y@\345\240\344\3337\023\314?\315\314\314\314\314\314\354\277\232\231\231\231\231\231\371?\000\000\000\000\000`j@(\225l\306\021\264\324?\232\231\231\231\231\231\351\277ffffff\002@\000\000\000\000\000\200Z@\355\r\2760\231*\320?333333\343\277333333\373?\000\000\000\000\000\000I@\351\327\332<\220\371\321?333333\363\277\000\000\000\000\000\000\000@\000\000\000\000\000@Z@\207D\370|ZW\326?\315\314\314\314\314\314\354\277\315\314\314\314\314\314\004@\000\000\000\000\000\200X@\2336\320i\003\035\320?\315\314\314\314\314\314\354\277\232\231\231\231\231\231\371?\000\000\000\000\000\000X@L\014\002+\207\026\321?ffffff\366\277\232\231\231\231\231\231\001@\000\000\000\000\000\000i@"
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 250
          }
          dim {
            size: 1
          }
        }
        tensor_content: "\273\323V\323?a\356\277+\272z\277\240\331\305?\230\342O\345\235\276\341?\001\223\3027W\350\315\277D0\367\244\013\266\327\277\273\205\312!\364\340\312\277\365\3445d\252\275R\2778\261\364*lg\324\277\207\237\216+=\370\320\277\215\323qT[\006\302\277\311\004\317\313.\304\242?\320\270\034Hoz\232? \030\337\305\233\017\306?\021\371\300\303\253\330\305?\3570\276\n\303W\335\277|!E\313\374R\264\277H\366RT0\365s?\373D\360h\253\024\273\277\226[\211\\\203\037\276?&\251W1\230P\353?\247\251\355R\264\246\375\277\030X\324\263\021\372\337\277\014\224;`i\017\317\2772\347=\205\330\020\242?\244V(\223\200\213\324\277e<^y\260Q\311?\264\210\354Ptm\331\277\315\356\0208\023\370\347?0\376\313\370\321\037\321\277\370\005rDUM\263?\206\223\203\343\356{\352\277\345\332\333\206\222f\270\2779\267\374D\242p\343?N\231S\222\266:\001\300\277\320\371\002)\356\303?\032v\376\235\333B\305?\026\202u\332\212\232\306?\024hb\250\261\312\322\277c\210\310\3131 \367?\005\343V\347\355H\325?<\300\245\311\252\230\347?\304\205\3579\271_\300?u\\\363(\177\200\362\2778\301\352\255m\246\253\277\376Dt\237\243\n\356\277\342&\035S`\203\330?Ul\250\233`\233\344?\002jJ~\323d\320?N\365n\246y\266\301\277\232\324\343T\374\341\323?\264\023>$\024z\341?\232\000\352n\222\200\363?\205HX*,o\314\277_\364\0325\007z\316?\030!\334\244\032\274\304\277\226V\355\237\270T\236\277\352\302\022*m\022\271\277\272Z\325\211\353\002\343\277\013\004M)\306#\276\277\366r\210\340R2\301?6T(\313Fj\322?\233A\245G\344\006\327\277\024\261{\321\215r\310?\346-\313\367\272\000\273?\"#>Py5\336?\367C(\274\261s\262?\0075s\267xU\331?\225\316\233\354\267\332\261\277\3736\236s\262\314\360\277\246^\262\212\334-\225\277\337\330\035&,\006\325\277\242\257\220\316\250\212\250\277C\26505\312\312\325\277b qcs\317\330\277!\031\202\036\216\260\341\277+c\230\334\234\351\353?%\324\315\231\337\252\260\277<\3136\352)\035\351\277\205)\253\324\246\351\341\277\310\267P\262\003\215j?\304M\243K~\241\331?8\272\246\332\003\311\352?Ry\265\024\034\250\244\277\007K\207\007gO\353?\364 \366D\211\023\270?\232\342\341\214\266\222\304\277\233\013\364\014\237\003\344?H\233\322\332\243\327\312?\230\243\224\303\010\021\315\277\364\304\320\312iZ\274\277\240\236\234\336AA\347?\236Ah\221,7\345\277\241CP\347!I\364\277enK\245:\371\240\277\013v>;\315R\307?\264\373z\363\360\203\000@\\\370X\2603\255\250\277x\206\362z:\237\302\277\223>\354F\237V\246\277 \256\217&\022\355\242\277\262cwbt\"\341?\353e\327\022.!\324\277\264\023t\246\245\027\332\277a\364\307\334\007\006\275?91/\017\313k\322?\257\341H\230\266\241\353\277\032.e\037\241\247\316?\272<B\251\317Z\333?O\256\332\265*>\312\2770fY\\\221Y\321\277\214\220%4\346\006\000\300\246\275\025\\ \320\316?\336\317\334\237X\010\303?Z\027/\332\325\024\347\277\363.\316\275\201\205\322?r\252\007\010\230\273\310\277\021.\215\3452\315\320\277\\\260k\356<\000\321?\237\311\244hT\233\323?\265T\331\237\354\024\376?MVWz\267t\343?H\245\305\337\030\251\303\277\377\246G\246\002;\320?n\264\230\367E\275\320\277\3148\263\212:\010\261?\351E\233\2172z\316?\260\013Df\373\241\344\2776\033\233\027\205\221\326\277-\360h#4\202\325?\021\373V\003(3\317?\256\332l\016\343\233\353\2772\361>\020\372\217\352?{:QL*$\305\277*1<w\262\233\270?/\014&|}\036\224?\351p\2249k\272\322\277\022\374\2161\355\276\326?`m\302`/A\366\277\006\366\037p\326\036\315?\215\362x\217\252\005\223?}\232\323\211\210\241\320?\310\324Vl\271.\326?\010co\327\322\035\346?\021\236p\334;H\336\277n\000\330v\247G\342\277K\223\027\230\232\254\330?pU\240\312\376\037\302\277\252<U\001\277;\342\277\372\255J\253A\323\360?l So\304\032\000\300\031M4\376\231g\225\277\255i\235n\201\365\246\277\275{\364{\254d\354\277\302D\037\216\202\023\324?XL\365\322\r*\177?\025\304V\322M\252\216\277\r\276%\207\220\204\266\277td\355~<d\341?D\346\021\r\330\177\316\277\366\227\325!\306\362\265\277$\377\263_p\372\322\277\327\034r\333D\255\217\277\347\200\264\354\307+\324?b\344\356\373m\313\252?m\244W`\032k\241\277\333v\272BjP\262\277\024\361R4C\371\251?\274\231\367\250\030W\277? \001\266\001\3479\247\277l\244\342n$\002\352\277d\020\375wB\025\314\277\372\234\304\211env\277\213\355\032w\210\363\312?\'PL\236\256\003\255?\324\304\367\341M\036\361\277\222\305\221\234\000\215\347\277Zi\212\346G\206\343\277\202h\017\303\270(\303?\026}\376\236\032\350\252\277\2301\332\021\013\234\272?B\323\201E\301\247\346?\232\212\024\014\320\350\311?\355\3444pz~\334?g\327\014\244\330\223\250?\"\n\'d\001\337\355?\333\337*U\226\000\321\277\330\177[\364\024\335\307\277\230O\214\314O\256\306?<\244\226\311\340\360\276?x\226\032\004\314\200\324?R\010\234\312\035[\320?\2441]\315\026\222\306?I\037\177\341\t\245\314\277y\347#\024\252\020\315?d\276\353\014\255h\267?i\014\315ZT\203\323?\323\031\265\\\014\347\347?\007J\360\336}}\307?\206\030\342v\021\272\306\277\361TT]\224\325\361\277\361e\354\264\360\315\264?geq>\242\217\310?Ys#\005!\204\305\277\021F#e=&\320\277\365\236\377\345(\260\322?\374\222\340;\276H\324\277@\340\364M\0254\364?m\334\315\261-\023\272?[<K\277\270\375\320?/\301\355\242\225\361\354?\362FO\275\263\251\006@\000\204\007e\225\340\327\277K\254|\233\345\363\315?\272P\261\021o\364\321\277\264\374\\\20167\375?\215\010\323\214v\346\302\277\361d=(\354\010\323?\250\366\377)\351#\353\277\244\241dm\303j\323\277y\224\341T\251:\321?\241e5\0076\251\253?\253n\237\363H\'\252\277jt\221\261*:\320\277\010\016\007\301\202\024\255?\035\212\252\001M\032\302?qT^7\237\213\235?\257\307Fy\220\337\316\277\002\016d\373\244\266\251?\365\201C8#\020\311?IM\363\346A\017\347\277\002\253\255\256\331j\321?h\273\006\322\236P\312\277\300\370\270\256\241\303\364\277o\235\205$lR\267\277\036v\r|\232\341\334?-\342u\276x\275\302\2771\177^b\367\250\260\277\324\023\361\021\202\365\363\277`\334\257\206\371\232\350?\364\034\333.\265\223\246?\332\226\215\025Di\334\277\225\025\t\2771\236\276\277\016n\354\326zh\313\277\035\313Z\323\316\017\324?T\337#\013\t\224\241\2777`\250\246c.\341?\356\374\370:\324\231\336?\272\003+2S\207\333?\2324\347q\317\033\307?2D\237Yi\243\333?"
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "linear/linear/ToFloat"
  op: "Cast"
  input: "Const"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "linear//weight/part_0/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear//weight/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 1
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "linear//weight/part_0"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear//weight/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear//weight/part_0/Assign"
  op: "Assign"
  input: "linear//weight/part_0"
  input: "linear//weight/part_0/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear//weight/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear//weight/part_0/read"
  op: "Identity"
  input: "linear//weight/part_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear//weight/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "linear//weight"
  op: "Identity"
  input: "linear//weight/part_0/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "matmul"
  op: "MatMul"
  input: "linear/linear/ToFloat"
  input: "linear//weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "linear/linear/Reshape/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\001\000\000\000"
      }
    }
  }
}
node {
  name: "linear/linear/Reshape"
  op: "Reshape"
  input: "matmul"
  input: "linear/linear/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "linear/bias_weight/part_0/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/bias_weight/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "linear/bias_weight/part_0"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/bias_weight/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear/bias_weight/part_0/Assign"
  op: "Assign"
  input: "linear/bias_weight/part_0"
  input: "linear/bias_weight/part_0/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/bias_weight/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear/bias_weight/part_0/read"
  op: "Identity"
  input: "linear/bias_weight/part_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/bias_weight/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "linear/bias_weight"
  op: "Identity"
  input: "linear/bias_weight/part_0/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "linear/linear/BiasAdd"
  op: "BiasAdd"
  input: "linear/linear/Reshape"
  input: "linear/bias_weight"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "linear/regression_head/predictions/scores"
  op: "Squeeze"
  input: "linear/linear/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 1
      }
    }
  }
}
node {
  name: "linear/regression_head/predictions/Identity"
  op: "Identity"
  input: "linear/regression_head/predictions/scores"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
        }
      }
    }
  }
}
node {
  name: "linear/regression_head/mean_squared_loss/ToFloat"
  op: "Cast"
  input: "Const_1"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "linear/regression_head/mean_squared_loss/sub"
  op: "Sub"
  input: "linear/linear/BiasAdd"
  input: "linear/regression_head/mean_squared_loss/ToFloat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "linear/regression_head/mean_squared_loss"
  op: "Square"
  input: "linear/regression_head/mean_squared_loss/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 250
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "linear/regression_head/mean_squared_loss/loss/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "linear/regression_head/mean_squared_loss/loss"
  op: "Mean"
  input: "linear/regression_head/mean_squared_loss"
  input: "linear/regression_head/mean_squared_loss/loss/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Identity"
  op: "Identity"
  input: "linear/regression_head/mean_squared_loss/loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "loss/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "loss"
      }
    }
  }
}
node {
  name: "loss"
  op: "ScalarSummary"
  input: "loss/tags"
  input: "Identity"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "linear/regression_head/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\372\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "linear/regression_head/strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear/regression_head/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
